Hi Joe,

 

I am finally getting back into this project.  I am needing to create about 150 sites using Terraform but as mentioned above, I can’t seem to get the cname record during the site creation. In tried your snippet of code and get an error “Null value found in list”.

 

Could it be a problem with version 0.12.18 of terraform?

 

Here are the versions that I am running:

venafilab@DESKTOP-0F6RKJH:~/Terraform/Demo Env/Incapsula$ terraform version

Terraform v0.12.18

+ provider.aws v2.50.0

+ provider.incapsula v2.1.0

+ provider.venafi v0.9.0

 



 

Here is my terraform show:

 

===================================================================

 

venafilab@DESKTOP-0F6RKJH:~/Terraform/Demo Env/Incapsula$ terraform apply

 

An execution plan has been generated and is shown below.

Resource actions are indicated with the following symbols:

  + create

 

Terraform will perform the following actions:

 

  # incapsula_custom_certificate.custom-certificate will be created

  + resource "incapsula_custom_certificate" "custom-certificate" {

      + certificate = (known after apply)

      + id          = (known after apply)

      + passphrase  = (sensitive value)

      + private_key = (sensitive value)

      + site_id     = (known after apply)

    }

 

  # incapsula_site.example-site will be created

  + resource "incapsula_site" "example-site" {

      + dns_a_record_name      = (known after apply)

      + dns_a_record_value     = (known after apply)

      + dns_cname_record_name  = (known after apply)

      + dns_cname_record_value = (known after apply)

      + domain                 = "incapsulatest4.se.venafi.com"

      + id                     = (known after apply)

      + ref_id                 = "12345"

      + site_creation_date     = (known after apply)

    }

 

  # venafi_certificate.webserver will be created

  + resource "venafi_certificate" "webserver" {

      + algorithm         = "RSA"

      + certificate       = (known after apply)

      + certificate_dn    = (known after apply)

      + chain             = (known after apply)

      + common_name       = "incapsulatest4.se.venafi.com"

      + csr_pem           = (known after apply)

      + ecdsa_curve       = "P521"

      + expiration_window = 168

      + id                = (known after apply)

      + private_key_pem   = (known after apply)

      + rsa_bits          = 2048

      + san_dns           = [

          + "san_example.se.venafi.com",

          + "anothersan_example.se.venafi.com",

        ]

    }

 

Plan: 3 to add, 0 to change, 0 to destroy.

 

Do you want to perform these actions?

  Terraform will perform the actions described above.

  Only 'yes' will be accepted to approve.

 

  Enter a value: yes

 

venafi_certificate.webserver: Creating...

incapsula_site.example-site: Creating...

venafi_certificate.webserver: Creation complete after 4s [id=\VED\Policy\Demo\APIs\HashiCorp Terraform\incapsulatest4.se.venafi.com]

incapsula_site.example-site: Creation complete after 5s [id=68207620]

incapsula_custom_certificate.custom-certificate: Creating...

incapsula_custom_certificate.custom-certificate: Creation complete after 1s [id=12345]

 

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

 

Outputs:

 

Incapsula_Domain = incapsulatest4.se.venafi.com

Incapsula_Site_ID = 68207620

venafilab@DESKTOP-0F6RKJH:~/Terraform/Demo Env/Incapsula$ terraform show >output.txt

venafilab@DESKTOP-0F6RKJH:~/Terraform/Demo Env/Incapsula$ terraform show >>output2.txt

venafilab@DESKTOP-0F6RKJH:~/Terraform/Demo Env/Incapsula$ terraform show

# incapsula_custom_certificate.custom-certificate:

resource "incapsula_custom_certificate" "custom-certificate" {

    certificate = <<~EOT

        -----BEGIN CERTIFICATE-----

        MIIF1zCCBL+gAwIBAgITbgAAAJKHRKbYCs7c4gAAAAAAkjANBgkqhkiG9w0BAQsF

        ADBHMRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJVmVuYWZp

        bGFiMRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwHhcNMjAwMjI1MjM0ODUxWhcNMjEw

        MjI0MjM0ODUxWjCBizELMAkGA1UEBhMCVVMxCzAJBgNVBAgTAlVUMRcwFQYDVQQH

        Ew5TYWx0IExha2UgQ2l0eTEVMBMGA1UEChMMVmVuYWZpLCBJbmMuMRgwFgYDVQQL

        Ew9BdXRvbWF0aW9uIFRlYW0xJTAjBgNVBAMTHGluY2Fwc3VsYXRlc3Q0LnNlLnZl

        bmFmaS5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQDcrTUdT3OK

        DhMQDWzfhkwhBen2//QgKZw93Lks6iKGN5gyDV53c3KGt0+OPVHUgIDnAhx44Xj4

       EaHMnXbZQWcj6VefGbGjEiKnoEHDavylLx43JSF+T5d0iHNmzFyglHVeni/zLbBI

        GBP0UAtViLhGPTz/xkmI9RpNstzxOe/J5qNGapYEGVy/U/urUdMgD50xpPwXxAUv

        jW5gNgordIAz/XO2xHSJw0t5F8VXiaXYv8V/SI3szZWq92rFRwwa8mfm9zvFXq+y

        69f1OQCFChG7/uPRdew690erXIVeBX1vhJIihh2WaKNyZXRj8U9asv413W8ZgNAf

………

        -----END CERTIFICATE-----

    EOT

    id          = "12345"

    passphrase  = (sensitive value)

    private_key = (sensitive value)

    site_id     = "68207620"

}

 

# incapsula_site.example-site:

resource "incapsula_site" "example-site" {

    dns_a_record_value = []

    domain             = "incapsulatest4.se.venafi.com"

    id                 = "68207620"

    ref_id             = "12345"

    site_creation_date = 1582675131000

}

 

# venafi_certificate.webserver:

resource "venafi_certificate" "webserver" {

    algorithm         = "RSA"

    certificate       = <<~EOT

        -----BEGIN CERTIFICATE-----

        MIIF1zCCBL+gAwIBAgITbgAAAJKHRKbYCs7c4gAAAAAAkjANBgkqhkiG9w0BAQsF

        ADBHMRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJVmVuYWZp

        bGFiMRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwHhcNMjAwMjI1MjM0ODUxWhcNMjEw

        MjI0MjM0ODUxWjCBizELMAkGA1UEBhMCVVMxCzAJBgNVBAgTAlVUMRcwFQYDVQQH

        Ew5TYWx0IExha2UgQ2l0eTEVMBMGA1UEChMMVmVuYWZpLCBJbmMuMRgwFgYDVQQL

        Ew9BdXRvbWF0aW9uIFRlYW0xJTAjBgNVBAMTHGluY2Fwc3VsYXRlc3Q0LnNlLnZl

………

        s8bW4YJzKP2a8T4=

        -----END CERTIFICATE-----

    EOT

    certificate_dn    = "\\VED\\Policy\\Demo\\APIs\\HashiCorp Terraform\\incapsulatest4.se.venafi.com"

    chain             = <<~EOT

        -----BEGIN CERTIFICATE-----

        MIIDaTCCAlGgAwIBAgIQFnSXFxdbiqdK59how61UdzANBgkqhkiG9w0BAQsFADBH

        MRMwEQYKCZImiZPyLGQBGRYDY29tMRkwFwYKCZImiZPyLGQBGRYJVmVuYWZpbGFi

        MRUwEwYDVQQDEwxWZW5hZmlMYWItQ0EwHhcNMTkxMTE1MTYwNTUxWhcNMjkxMTE1

………….

        -----END CERTIFICATE-----

    EOT

    common_name       = "incapsulatest4.se.venafi.com"

    ecdsa_curve       = "P521"

    expiration_window = 168

    id                = "\\VED\\Policy\\Demo\\APIs\\HashiCorp Terraform\\incapsulatest4.se.venafi.com"

    private_key_pem   = <<Removed>

    rsa_bits          = 2048

    san_dns           = [

        "san_example.se.venafi.com",

        "anothersan_example.se.venafi.com",

    ]

}

 

 

Outputs:

 

Incapsula_Domain = "incapsulatest4.se.venafi.com"

Incapsula_Site_ID = "68207620"

venafilab@DESKTOP-0F6RKJH:~/Terraform/Demo Env/Incapsula$  

 

=========================================================

Here is my Incapsula file:

 

# Configure the Venafi provider (Trust Protection Platform)

provider "venafi" {

    #alias        = "tpp"

    url          = "https://tppdemo.se.venafi.com:443/vedsdk"

    tpp_username = var.tppusername

    tpp_password = var.tpppassword

    zone         = "Demo\\APIs\\HashiCorp Terraform"

    trust_bundle = file("venafilab_trust_bundle.pem")    

}

# Generate a key pair and request a certificate

resource "venafi_certificate" "webserver" {

    common_name = "incapsulatest4.se.venafi.com"

    algorithm = "RSA"

    rsa_bits = "2048"

    san_dns = [

        "san_example.se.venafi.com",

        "anothersan_example.se.venafi.com"

    ]

    #key_password = "${var.pk_pass}"

}

 

provider "incapsula" {

  api_id = var.incapsula_api_id

  api_key = var.incapsula_api_key

}

 

resource "incapsula_site" "example-site" {

  domain                 = "incapsulatest4.se.venafi.com"

  #account_id             = "1014181"

  ref_id                 = "12345"

  #send_site_setup_emails = "true"

  #site_ip                = "1.2.3.4"

  #force_ssl              = "true"

}

 

resource "incapsula_custom_certificate" "custom-certificate" {

  site_id     = incapsula_site.example-site.id

  certificate = venafi_certificate.webserver.certificate

  private_key = venafi_certificate.webserver.private_key_pem

  passphrase  = "Passw0rd123"

}

 

#Provides Access to AWS

provider "aws" {

  region     = "us-east-1"

  profile    = "default"

}

 

resource "aws_route53_record" "incapsula_record" {

  depends_on = [incapsula_site.example-site]

  #zone_id = "${aws_route53_zone.primary.zone_id}"

  zone_id = "Z2OK9J9XX7JRH6"

  name    = "${var.Incapsula_DNS_Name}${var.Incapsula_Iteration}${var.My_Domain}"

  type    = "CNAME"

  ttl     = "60"

  records = ["${incapsula_site.example-site.dns_cname_record_value}"]

  #allow_overwrite = true

}

 

#Output the Site ID for the Website

output "Incapsula_Site_ID" {

    value = incapsula_site.example-site.id

}

 

#Output the Domain for the Website

output "Incapsula_Domain" {

    value = incapsula_site.example-site.domain

}

 

#Output the CNAME for the Website

output "Incapsula_dns_a_record_name" {

    value = incapsula_site.example-site.dns_a_record_name

}

 

#Output the CNAME for the Website

output "Incapsula_dns_cname_record_name" {

    value = incapsula_site.example-site.dns_cname_record_name

}

 

#Output the CNAME for the Website

output "Incapsula_CNAME_Value" {

    value = incapsula_site.example-site.dns_cname_record_value

}

 

 

Any help would be greatly appreciated.

 

Regards,

 

Jeremy Meldrum

 

From: Joe Moore <notifications@github.com> 
Sent: Monday, January 13, 2020 6:13 PM
To: imperva/terraform-provider-incapsula <terraform-provider-incapsula@noreply.github.com>
Cc: Jeremy Meldrum <jeremy.meldrum@venafi.com>; Mention <mention@noreply.github.com>
Subject: Re: [imperva/terraform-provider-incapsula] Unable to output the "dns_cname_record_value " when adding a site (#28)

 

@jmeldrum76 [github.com] <https://urldefense.com/v3/__https:/github.com/jmeldrum76__;!!Ati4tGle!-cvkSQLJYtEvcoSVzsXlJUuTLiJrtzRuaYJlFkp4wllM7Lpm7XKXdRbWgfNeIazld4JW$> 
Below is the TF snippet that I use to accomplish the route53 record add.

resource "aws_route53_record" "superveda_record" {
depends_on = ["incapsula_site.superveda"]
name = "stage-superveda.${data.aws_route53_zone.zone.name}"
type = "CNAME"
zone_id = "${data.aws_route53_zone.zone.zone_id}"
ttl = "60"
records = ["${incapsula_site.superveda.dns_cname_record_value}"]
}

—
You are receiving this because you were mentioned.
Reply to this email directly, view it on GitHub [github.com] <https://urldefense.com/v3/__https:/github.com/imperva/terraform-provider-incapsula/issues/28?email_source=notifications&email_token=AFB65JEEL2MKHVVYKM7NMGDQ5UGTNA5CNFSM4KFLOECKYY3PNVWWK3TUL52HS4DFVREXG43VMVBW63LNMVXHJKTDN5WW2ZLOORPWSZGOEI24Z6A*issuecomment-573951224__;Iw!!Ati4tGle!-cvkSQLJYtEvcoSVzsXlJUuTLiJrtzRuaYJlFkp4wllM7Lpm7XKXdRbWgfNeIROnJISd$> , or unsubscribe [github.com] <https://urldefense.com/v3/__https:/github.com/notifications/unsubscribe-auth/AFB65JD63N3W5WRRQL7QAWLQ5UGTNANCNFSM4KFLOECA__;!!Ati4tGle!-cvkSQLJYtEvcoSVzsXlJUuTLiJrtzRuaYJlFkp4wllM7Lpm7XKXdRbWgfNeIaRIE3Di$> .  <https://github.com/notifications/beacon/AFB65JCN75SM2JAJP6NIWIDQ5UGTNA5CNFSM4KFLOECKYY3PNVWWK3TUL52HS4DFVREXG43VMVBW63LNMVXHJKTDN5WW2ZLOORPWSZGOEI24Z6A.gif> 

